! ===============================================
! Campus LAN Router Configuration
! Interface G0/0 Configuration for DHCP Server
! ===============================================

Router>enable
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.

! Configure GigabitEthernet0/0 interface
Router(config)#interface g0/0
Router(config-if)#ip address 192.168.1.1 255.255.255.0
Router(config-if)#no shutdown

! Interface status messages
%LINK-5-CHANGED: Interface GigabitEthernet0/0, changed state to up
%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to up

! Exit interface configuration mode
Router(config-if)#exit

! Exit global configuration mode
Router(config)#end

! Save configuration to NVRAM
%SYS-5-CONFIG_I: Configured from console by console
Router#write memory
Building configuration...
[OK]
Router#
